export const SpaceInfoMatcher = [
    -1, 0, 0, 0, 1, 1, 2, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11
];

export const SpaceInfo: {
    img: string;
    desc: string;
}[] = [{
    img: "Individual-Practice-Room",
    desc: "혼자 악기나 보컬 연습 등을 진행할 수 있는 방음실. 장영신학생회관 1층에 위치해 있다."
}, {
    img: "Piano-Room",
    desc: "혼자 피아노 연주 연습을 진행 할 수 있는 방음실. 장영신학생회관 1층에 위치해 있다."
}, {
    img: "Seminar-Room",
    desc: "단체로 회의, 정기모임 등 다양한 활동을 진행할 수 있는 회의실. 장영신학생회관 3층에 위치해 있다."
}, {
    img: "Dance-Studio",
    desc: "춤 연습을 할 수 있는 공간. 장영신학생회관 1층 피아노실 앞에 위치해 있다."
}, {
    img: "Group-Practice-Room",
    desc: "밴드 공연 연습 등을 위한 합주방음실. 장영신학생회관 1층에 위치해 있다."
}, {
    img: "Mirae-Hall",
    desc: "주로 밴드 공연을 진행하는 무대가 있고, 관람 의자가 있는 공연장. 장영신학생회관 옆 태울관에 위치해 있다."
}, {
    img: "Sumi-Jo-Hall",
    desc: "무대활동, 단체관람 등의 행사를 진행하는 대형홀. 장영신학생회관 1층에 위치해 있다."
}, {
    img: "Workshop",
    desc: "그림 그리기, 만들기와 같은 활동을 진행할 수 있는 공간. 장영신학생회관 3층에 위치해 있다."
}, {
    img: "Open-Space",
    desc: "버스킹과 여러 캠페인 등을 진행할 수 있는 야외의 넓은 공간. 장영신학생회관 야외계단 앞에 위치해 있다."
}, {
    img: "Exhibition-Stairs",
    desc: "공예 작품을 전시할 수 있고, 기둥에 홍보 포스터를 부착할 수 있는 계단 공간. 장영신학생회관 1층과 2층 사이 계단이다."
}, {
    img: "1st-Floor-Lobby",
    desc: "장영신학생회관 1층 로비. 학생회관의 안내데스크가 위치해 있다. 장영신학생회관의 1층 문을 열면 보이는 넓은 공간으로, 각종 캠페인 등에 활용할 수 있다."
}, {
    img: "2nd-Floor-Lobby",
    desc: "장영신학생회관 2층 로비. 학생회관의 휴게 공간이자, 전시 공간이기도 하다. 장영신학생회관의 2층 문을 열면 보이는 넓은 공간으로, 각종 캠페인 등에 활용할 수 있다. (퀴즈노스, 엔젤리너스 공간은 2층 로비에 포함되지 않는다.)"
}];
